tap 'homebrew/bundle'

brew 'ack'
brew 'autoconf'
brew 'checkbashisms'
brew 'coreutils'
brew 'cowsay'
brew 'direnv'
brew 'ffmpeg'
brew 'figlet'
brew 'fzf'
brew 'gawk'
brew 'gdbm'
brew 'gifsicle'
brew 'git'
brew 'go', args: ['cross-compile-common']
brew 'hub'
brew 'hugo'
brew 'jq'
brew 'lame'
brew 'libevent'
brew 'mercurial'
brew 'nkf'
brew 'openssl'
brew 'peco'
brew 'python'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'shellcheck'
brew 'sqlite'
brew 'terminal-notifier'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['with-lua', 'with-luajit']
brew 'wget'
brew 'zsh', args: ['disable-etcdir']
brew 'zsh-completions'

tap 'caskroom/cask'
brew 'brew-cask'
cask 'appcleaner'
cask 'virtualbox'
cask 'vagrant'
