# TODO: move some of these (CLI related dependencies into the AFX setup as possible)

tap "hashicorp/tap"
tap "homebrew/bundle"
# tap "homebrew/cask"
tap "homebrew/cask-fonts"
# tap "homebrew/core"

cask "font-hack-nerd-font"

brew "hashicorp/tap/terraform-ls"
brew "helmfile"
brew "kustomize"
brew "terraform"

#
# Brew
#   https://formulae.brew.sh/
#
brew "exiftool"
brew "gawk"
brew "gnu-sed"
brew "go"
brew "goreleaser"
brew "grep"
# brew "hugo"

brew "libidn2"
brew "litecli"
brew "lua-language-server"
brew "luarocks"
brew "mas" if OS.mac?
brew "mysql"
brew "tmux"
brew "wget"

brew "moreutils"
brew "findutils"
brew "grep"
brew "gnu-sed"
brew "ack"
brew "adns"

# it may take a little while
brew "ffmpeg"
brew "gifsicle"
brew "ttyd"
brew "gum"
brew "vhs" # faressoft/terminalizer
# brew "exa"
# brew "neofetch"
# brew "asdf"

brew "unrar"
brew "unzip"
brew "p7zip" # 7z
brew "pigz"  # gz
brew "git"
brew "git-lfs"


# https://github.com/yuru7/HackGen
# brew "font-hackgen"
# brew "font-hackgen-nerd"

#
# Cask
#   https://formulae.brew.sh/cask/
#
cask "1password"
cask "adobe-creative-cloud"
cask "appcleaner"
cask "docker"
cask "google-chrome"
cask "hiddenbar" # alternative for "bartender"
cask "inkdrop"
cask "iterm2"
cask "numi"
cask "obs"
cask "obsidian"
cask "path-finder"
cask "popclip"
cask "postman"
cask "qlmarkdown"
cask "rectangle" # alternative for "Magnet"
cask "slack"
cask "spotify"
cask "tableplus"
cask "the-unarchiver"
cask "typora"

# cant be installed for this computer (assume M1
# cask "osxfuse"
cask "xquartz"
cask "keepingyouawake"
# cask "adoptopenjdk"
cask "dropbox"
cask "istat-menus"
cask "1password"
cask "daisydisk"
cask "alfred"
cask "bartender"
cask "dash"
cask "little-snitch"
cask "micro-snitch"
# cask "ipartition"
cask "fantastical"
cask "slack"
cask "zoom"
cask "google-chrome"
# cask "google-chrome-canary"
cask "firefox"
cask "wifi-explorer"
cask "hazel"
cask "textual"
cask "freecad"
cask "postman"
cask "appcleaner"
cask "geektool"
cask "atom"
cask "jetbrains-toolbox"
cask "gitkraken"
cask "kdiff3"
cask "kindle"
cask "spectacle"
cask "wireshark-chmodbpf"
cask "beamer"
cask "libreoffice"
cask "spotify"
cask "cakebrew"
cask "cardhop"
cask "grammarly"
cask "mactracker"
cask "teamviewer"
cask "charles"
cask "hex-fiend"
cask "meld"
cask "transmission"
cask "timely"
cask "gpg-suite"
cask "veracrypt"
cask "exodus"
cask "wine-stable"
cask "battle-net"
cask "wineskin-winery"
cask "steam"
cask "firestormos"
cask "epic-games"
cask "unity"
cask "vlc"

# Virtual SubSystem
cask "virtualbox"
cask "docker"

#  CTF Tools
brew "aircrack-ng"
brew "bfg"
brew "binutils"
brew "binwalk"
brew "cifer"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "foremost"
brew "hashpump"
brew "hydra"
brew "john"
brew "knock"
brew "netpbm"
brew "nmap"
brew "pngcheck"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "ucspi-tcp"
brew "xpdf"
brew "xz"
brew "shellcheck"
brew "spim"
brew "wget"
brew "go"
brew "ant"
brew "eigen"


#
# Mac App Store
#   https://github.com/mas-cli/mas
#
mas "Fantastical", id: 975937182
mas "LadioCast", id: 411213048
mas "Magnet", id: 441258766
mas "MenubarX", id: 1575588022
mas "Paste", id: 967805235
mas "Spark", id: 1176895641
mas "Things 3", id: 904237743
mas "Translate Tab", id: 458887729
mas "Yoink", id: 457622435
mas "Amphetamine", id: 937984704
mas "Rename X", id: 1438841416
# mas "Name Mangler 3", id: 603637384
mas "DaisyDisk", id: 411643860
mas "ToyViewer", id: 414298354
mas "MeetingBar for Meet, Zoom & Co", id: 1532419400
