tap "hashicorp/tap"
tap "homebrew/bundle"

#
# Brew
#   https://formulae.brew.sh/
#
brew "bash"
brew "difftastic"
brew "exiftool"
brew "gawk"
brew "gnu-sed"
brew "go"
brew "goreleaser"
brew "grep"
brew "hashicorp/tap/terraform-ls"
brew "helmfile"
brew "hugo"
brew "kustomize"
brew "libidn2"
brew "litecli"
brew "lua-language-server"
brew "luarocks"
brew "mas" if OS.mac?
brew "mysql"
brew "terraform"
brew "tmux"
brew "wget"
brew "yarn"

# it may take a little while
brew "ffmpeg"
brew "gifsicle"
brew "ttyd"
brew "gum"
brew "vhs" # faressoft/terminalizer

#
# Cask
#   https://formulae.brew.sh/cask/
#
cask "1password"
cask "adobe-creative-cloud"
cask "appcleaner"
cask "cleanshot"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-japanese-ime"
cask "hiddenbar" # alternative for "bartender"
cask "inkdrop"
cask "iterm2"
cask "numi"
#cask "obs" # no longer used
cask "obsidian"
cask "path-finder"
cask "popclip"
#cask "postman"
cask "qlmarkdown"
cask "rectangle" # alternative for "Magnet"
cask "slack"
cask "spotify"
cask "tableplus"
cask "the-unarchiver"
cask "typora"
cask "wezterm"
cask "zoom"

#
# Mac App Store
#   https://github.com/mas-cli/mas
#
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Fantastical", id: 975937182
mas "LadioCast", id: 411213048
mas "Magnet", id: 441258766
mas "MeetingBar for Meet, Zoom & Co", id: 1532419400
mas "MenubarX", id: 1575588022
mas "Paste", id: 967805235
mas "Spark", id: 1176895641
mas "Tailscale", id: 1475387142
mas "Things 3", id: 904280696
# mas "Equinox - Create Wallpaper", id: 1591510203
# mas "Translate Tab", id: 458887729
mas "Yoink", id: 457622435
# mas "Name Mangler 3", id: 603637384
# mas "Rename X", id: 1438841416
# mas "ToyViewer", id: 414298354
