tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "johanhaleby/kubetail"
tap "keidarcy/tap"
brew "ack"
brew "adns"
brew "aircrack-ng"
brew "icu4c@76"
brew "ant"
brew "asdf"
brew "awscli"
brew "bfg"
brew "binutils"
brew "p7zip"
brew "binwalk"
brew "cifer"
brew "dex2jar"
brew "dns2tcp"
brew "docker-compose"
brew "eigen"
brew "exiftool"
brew "fcrackzip"
brew "libidn2"
brew "ffmpeg"
brew "findutils"
brew "foreman"
brew "foremost"
brew "gawk"
brew "gifsicle"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "go-task"
brew "goreleaser"
brew "grep"
brew "gum"
brew "hashpump"
brew "helm"
brew "helmfile"
brew "hydra"
brew "john"
brew "k9s"
brew "knock"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "lazydocker"
brew "libmagic"
brew "litecli"
brew "lolcat"
brew "lua-language-server"
brew "luarocks"
brew "mas"
brew "minikube"
brew "mkcert"
brew "moreutils"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "netpbm"
brew "nmap"
brew "ollama"
brew "pdm"
brew "pigz"
brew "pngcheck"
brew "postgresql@14"
brew "python-tk@3.12"
brew "saml2aws"
brew "shellcheck"
brew "showkey"
brew "skaffold"
brew "socat"
brew "spim"
brew "sqlmap"
brew "subversion"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "tilt"
brew "tmux"
brew "tree"
brew "ttyd"
brew "ucspi-tcp"
brew "unzip"
brew "vhs"
brew "wget"
brew "xpdf"
brew "aws/tap/copilot-cli"
brew "hashicorp/tap/terraform-ls"
brew "johanhaleby/kubetail/kubetail"
brew "keidarcy/tap/e1s"
cask "alfred"
cask "appcleaner"
cask "atom"
cask "bartender"
cask "beamer"
cask "cakebrew"
cask "cardhop"
cask "charles"
cask "cursor"
cask "daisydisk"
cask "dash"
cask "dbvisualizer"
cask "devtoys"
cask "docker"
cask "firefox"
cask "font-3270-nerd-font"
cask "font-hack-nerd-font"
cask "freecad"
cask "geektool"
cask "gpg-suite"
cask "hazel"
cask "hex-fiend"
cask "inkdrop"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keepingyouawake"
cask "kindle"
cask "little-snitch"
cask "macfuse"
cask "mactracker"
cask "micro-snitch"
cask "ngrok"
cask "notion"
cask "numi"
cask "obsidian"
cask "path-finder"
cask "postico"
cask "postman"
cask "qlmarkdown"
cask "rectangle-pro"
cask "requestly"
cask "session-manager-plugin"
cask "spotify"
cask "textual"
cask "typora"
cask "veracrypt"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "wifi-explorer"
cask "wireshark-chmodbpf"
cask "xquartz"

mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Yoink", id: 457622435



vscode "10nates.ollama-autocoder"
vscode "766b.go-outliner"
vscode "aaron-bond.better-comments"
vscode "aaronyoung.dark-synthwave-vscode"
vscode "adpyke.codesnap"
vscode "agutierrezr.emmet-keybindings"
vscode "agutierrezr.react-vsc-essentials"
vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "almenon.arepl"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anteprimorac.html-end-tag-labels"
vscode "antyos.openscad"
vscode "arrterian.nix-env-selector"
vscode "batisteo.vscode-django"
vscode "bbenoist.nix"
vscode "benjaminbenais.copilot-theme"
vscode "benspaulding.procfile"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-yaml-preamble"
vscode "bodil.file-browser"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "brunnerh.file-properties-viewer"
vscode "burkeholland.simple-react-snippets"
vscode "cameron.vscode-pytest"
vscode "casperstorm.directory-files"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "corernd.wai-vscode"
vscode "cstrap.python-snippets"
vscode "ctc.vscode-tree-extension"
vscode "ctf0.activitybar-separator"
vscode "cungen.markdown-slide"
vscode "dalirnet.rtl-markdown"
vscode "danielsanmedium.dscodegpt"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "demystifying-javascript.python-extensions-pack"
vscode "dhoeric.ansible-vault"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "ekelley.midnight-synth"
vscode "endormi.2077-theme"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "fabiospampinato.vscode-monokai-night"
vscode "fabiospampinato.vscode-open-in-github"
vscode "fabioz.vscode-pydev"
vscode "fabioz.vscode-pydev-python-debugger"
vscode "felipecaputo.git-project-manager"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "gera2ld.markmap-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "gsgupta.opencv-snippets"
vscode "hall.draw"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "infeng.vscode-react-typescript"
vscode "inu1255.easy-snippet"
vscode "ipedrazas.kubernetes-snippets"
vscode "irongeek.vscode-env"
vscode "jacobdufault.fuzzy-search"
vscode "james-yu.latex-workshop"
vscode "jasonlhy.hungry-delete"
vscode "jebbs.plantuml"
vscode "jmkrivocapich.drawfolderstructure"
vscode "jnoortheen.nix-ide"
vscode "johnguo.simply-view-image-for-python-opencv-debugging"
vscode "jscearcy.rust-doc-viewer"
vscode "juanblanco.solidity"
vscode "juliangmp.openscad-formatter"
vscode "kaih2o.python-resource-monitor"
vscode "kakumei.ts-debug"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "knowsuchagency.pdm-task-provider"
vscode "leathong.openscad-language-support"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "lunuan.kubernetes-templates"
vscode "marp-team.marp-vscode"
vscode "matangover.mypy"
vscode "mattiasbaake.vscode-snippets-for-ansible"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "micnil.vscode-checkpoints"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "mishkinf.goto-next-previous-member"
vscode "mkhl.direnv"
vscode "mkxml.vscode-filesize"
vscode "mongodb.mongodb-vscode"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "mtsmfm.vscode-stl-viewer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "naumovs.color-highlight"
vscode "nguyenngoclong.asdf"
vscode "nickmillerdev.pytest-fixtures"
vscode "nidu.copy-json-path"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "node-projects.vscode-designer-addon"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "p1c2u.docker-compose"
vscode "pamaron.pytest-runner"
vscode "paulvarache.vscode-taskfile"
vscode "peterhdd.github-folder"
vscode "peterj.proto"
vscode "pinage404.nix-extension-pack"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "pomdtr.markdown-kroki"
vscode "postman.postman-for-vscode"
vscode "pranaygp.vscode-css-peek"
vscode "premparihar.gotestexplorer"
vscode "prisma.prisma"
vscode "redhat.ansible"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rubymaniac.vscode-direnv"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryu1kn.partial-diff"
vscode "sburg.vscode-javascript-booster"
vscode "searking.preview-vscode"
vscode "shamanu4.django-intellisense"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shinotatwu-ds.file-tree-generator"
vscode "shopify.ruby-lsp"
vscode "signageos.signageos-vscode-sops"
vscode "sourcery.sourcery"
vscode "spmeesseman.vscode-taskexplorer"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "suhay.vscode-editor-group-minimizer"
vscode "swellaby.rust-pack"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "tchayen.markdown-links"
vscode "tchoupinax.tilt"
vscode "technovangelist.ollamamodelfile"
vscode "tilt-dev.tiltfile"
vscode "tim-koehler.helm-intellisense"
vscode "tomoki1207.pdf"
vscode "toramameseven.markdown-docx"
vscode "torn4dom4n.latex-support"
vscode "trabpukcip.wolf"
vscode "ts-emmet.ts-emmet"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "voorjaar.windicss-intellisense"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-extensions-farshid.vscode-extensions-farshid"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xirider.livecode"
vscode "yatki.vscode-surround"
vscode "ysemeniuk.emmet-live"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
vscode "zxh404.vscode-proto3"
